rodruizronald/nRF24-PSoC-5LP-Library/library/nrf24l01.c
#define AW                              0
#define ARD                             4
#define ARC                             0
#define PLOS_CNT                        4
#define ARC_CNT                         0

//*****************************************************************************
//
//  The following are defines for logic operations.
//
//*****************************************************************************

#define READ                            0
#define WRITE                           1
#define LOW                             0
#define HIGH                            1

//*****************************************************************************
//
//  The following are defines for the application.
//
//*****************************************************************************

#define FIRST_INDEX                     0
#define CONFIG_PARAM                    5
#define NUM_VARIABLES                   9
#define DATA_LENGHT                     10
#define REPLY_LENGHT                    32
#define VARIABLES_LENGTH                3
#define ADDRESS_WIDTH                   0x03
#define ADDRESS_LENGTH                  0x05
#define COMMAND_LENGTH                  0x01
#define RF_CHANNEL                      0x02
#define TX_OUTPUT_POWER                 0x03
#define IRQ_RESET                       0x70
#define MAX_RT_RESET                    0x10
#define MAX_PLOS_CTN                    0x0F
#define ADR_VALUE                       0x02
#define ARC_VALUE                       0x0F

//*****************************************************************************
//
//  The following are defines for the transmission status.
//
//*****************************************************************************

#define NRF24_ACK_PAYLOAD_RECEIVED      0
#define NRF24_TRANSMISSION_FAILED       1

//*****************************************************************************
//
//  The following are global arrays to store data and var_idiables
//  to save reponse codes and flags.
//
//*****************************************************************************

//
//  Address for the PRX devices (each one must be unique).
//
static const uint8_t g_pipe0_address[][ADDRESS_LENGTH] =
{
  {0x4A,0x2B,0x3C,0x5D,0x1E},
  {0x2B,0x6D,0x7E,0x7A,0x8F},
  {0x4C,0x5C,0x8D,0x6B,0x9D},
  {0x6D,0x4B,0x9C,0x5C,0x0C},
  {0x7E,0x3A,0x0B,0x4D,0x1B},
  {0x8F,0x2E,0x2A,0x3E,0x2A}
};

static const char *g_var_idiable_id[NUM_VARIABLES] =
{
  "0", "1", "2",
  "3", "4", "5"
};

//
//  Data buffers.
//
static char g_value_buffer[DATA_LENGHT];
static char g_reply_buffer[REPLY_LENGHT];
static uint8_t g_nrf24_config[CONFIG_PARAM];
static uint8_t g_data_int[NUM_VARIABLES];
static float g_data_float[VARIABLES_LENGTH];
static char *g_data_string[VARIABLES_LENGTH];

//
//  System flags and data bytes.
//
static volatile uint8_t g_last_id = 10;
static volatile uint8_t g_ptx = false;
static volatile uint8_t g_request_flag = false;
static volatile uint8_t g_status = 0;
static volatile uint8_t g_incoming_byte = 0;
static volatile uint8_t g_master_reset = false;

//*****************************************************************************
//
//  Prototypes for the private functions.
//
//*****************************************************************************

//
//  NRF24L01 internal configuration.
//
static void nrf24_config(uint8_t ptx, uint8_t id);

//
//  Status and control registers.
//
static uint8_t check_status(void);
static void nrf24_irq_clear(void);
static void nrf24_plos_ctn_reset(void);
static uint8_t nrf24_get_status(void);
static uint8_t nrf24_get_lost_packets_count(void);

//
//  SPI Interface.
//
static char nrf24_spi_handler(uint8_t task, uint8_t reg, char *arr, uint8_t len);
static char spi_transfer(char data);

//
//  Flush data.
//
static void flush_tx(void);
static void flush_rx(void);
static void nrf24_reset(void);

//
//  Address configuration.
//
static void set_address(uint8_t id);

//
//  Power control.
//
static void pwr_state(uint8_t state);

//
//  PRX - Acknowledgments.
//
static void attach_tx_payload(char *data, uint8_t len);
static void attach_ack_int(uint8_t data);
static void attach_ack_float(float data);
static void attach_ack_string(char *data, uint8_t len);
static void attach_ack_payload(char *data, uint8_t len);

//
//  PTX - Packets request and transmission.
//
static void ptx_request(uint8_t var_id, uint8_t prx_id);
static void ptx_transmit_int(int data, uint8_t prx_id);
static void ptx_transmit_float(float data, uint8_t prx_id);
static void ptx_transmit_string(char *data, uint8_t len, uint8_t prx_id);

//*****************************************************************************
//
//  Functions for the API.
//
//*****************************************************************************
//*****************************************************************************
//
//! @brief Initialize the NRF24.
//!
//! This function initilizes the SPI interface, attaches an ISR to the nrf24
//! IRQ pin for interrupt reuqests and configures the nRF24 module based on the
//! passed parameters.
//!
//! @param[in] mode Operation mode of the NRF24 (PTX/PRX).
//! @param[in] id   Unique id of the NRF24 (address).
//!
//! @return None.
//
//*****************************************************************************
void
NRF24_init(uint8_t mode, uint8_t id)
{
  g_status = 0;
  g_last_id = 10;
  g_incoming_byte = 0;

  g_ptx = false;
  g_master_reset = false;
  g_request_flag = false;

  //
  //  Initilize Serial Peripheral Interface.
  //
  SPI_Start();

  //
  //  Attach an ISR to the nrf24.
  //
  nrf24_Int_StartEx(nrf24_Int_Handler);

  //
  //  Configure the nrf24.
  //
  nrf24_config(mode, id);

  //
  //  Perform general reset (buffers flushed and flags cleared).
  //
  nrf24_reset();
}

//*****************************************************************************
//
//! @brief Request data to an PRX device.
//!
//! This function requests an specific var_idiable already store in an PRX device.
//!
//! @param[in] var_id  ID of the variable requested to the PRX device.
//! @param[in] prx_id  Unique id of the PRX device.
//!
//! @return status     Result of request operation, if status is equal to true,
//!                    then the transmission was successful, if not, it failed.
//
//*****************************************************************************
uint8_t
NRF24_request_data(uint8_t var_id, uint8_t prx_id)
{
  //
  //  First request - notify PRX device which var_idiable is required.
  //
  g_request_flag = false;
  ptx_request(var_id, id);

  //
  //  Wait until packet is recieved.
  //
  while(!g_request_flag);

  //
  //  If debug is enable, UART will display the status of the latest reply.
  //  Check if transmission was successful.
  //
  if(!check_status()) return false;

  _delay_ms(350);

  //
  //  Second request - let the PRX device send that var_idiable.
  //
  g_request_flag = false;
  ptx_request(var_id, id);

  //
  //  Wait until packet is recieved.
  //
  while(!g_request_flag);

  //
  //  If debug is enable, UART will display the status of the latest reply.
  //  Check if transmission was successful.
  //
  if(!check_status()) return false;

