rodruizronald/nRF24-PSoC-5LP-Library/library/nrf24l01.c
  return true;
}

//*****************************************************************************
//
//! @brief Assign an integer value to a variable.
//!
//! This function assign or updates the current value on an interger variable
//! in the PRX device. Variables are manage by array inside the library.
//!
//! @param[in] var_id  ID of the variable store in the PRX device.
//! @param[in] value   Data to assign to the variable.
//!
//! @return None.
//
//*****************************************************************************
void
NRF24_assign_int(uint8_t var_id, int value)
{
  g_data_int[var_id] = value;
}

//*****************************************************************************
//
//! @brief Assign an string value to a variable.
//!
//! This function assign or updates the current value on an string variable
//! in the PRX device. Variables are manage by array inside the library.
//!
//! @param[in] var_id  ID of the variable store in the PRX device.
//! @param[in] value   Data to assign to the variable.
//!
//! @return None.
//
//*****************************************************************************
void
NRF24_assign_string(uint8_t var_id, char* value)
{
  g_data_string[var_id] = value;
}

//*****************************************************************************
//
//! @brief Assign an float value to a variable.
//!
//! This function assign or updates the current value on an float variable
//! in the PRX device. Variables are manage by array inside the library.
//!
//! @param[in] var_id  ID of the variable store in the PRX device.
//! @param[in] value   Data to assign to the variable.
//!
//! @return None.
//
//*****************************************************************************
void
NRF24_assign_float(uint8_t var_id, float value)
{
  g_data_float[var_id] = value;
}

//*****************************************************************************
//
//! @brief Get data requested.
//!
//! This function returns an string with the last requested variable.
//!
//! @return g_reply_buffer Buffer of characters.
//
//*****************************************************************************
char*
NRF24_get_data(void)
{
  return g_reply_buffer;
}

//*****************************************************************************
//
//! @brief Configure the NRF24 module.
//!
//! This function writes on the NRF24 registers the desired configuration based
//! on default and passed parameters.
//!
//! @param[in] ptx  Operation mode of the NRF24 (PTX -> true/false).
//! @param[in] id   Unique id of the NRF24 (address).
//!
//! @return None.
//
//*****************************************************************************
static void
nrf24_config(uint8_t ptx, uint8_t id)
{
  //
  //  Wait for power down mode.
  //
  _delay_ms(15);
  g_nrf24_config[FIRST_INDEX] = 0x00;

  //
  //  Enable/Disable Auto Acknowledgment Data Pipes (0-5).
  //  ENAA_P1 - P5: Auto Ack. Disable.
  //  ENAA_P0: Auto Ack. Enable.
  //
  g_nrf24_config[FIRST_INDEX] = HIGH << ENAA_P0
                      | LOW << ENAA_P1
                      | LOW << ENAA_P2
                      | LOW << ENAA_P3
                      | LOW << ENAA_P4
                      | LOW << ENAA_P5;
  nrf24_spi_handler(WRITE, EN_AA, g_nrf24_config, COMMAND_LENGTH);

  //
  //  Enable/Disable Data Pipes (0-5) RX address.
  //  ERX_P1 - P5: Data Pipes Disable.
  //  ERX_P0: Data Pipe Enable.
  //
  g_nrf24_config[FIRST_INDEX] = HIGH << ERX_P0
                      | LOW << ERX_P1
                      | LOW << ERX_P2
                      | LOW << ERX_P3
                      | LOW << ERX_P4
                      | LOW << ERX_P5;
  nrf24_spi_handler(WRITE, EN_RXADDR, g_nrf24_config, COMMAND_LENGTH);

  //
  //  RX/TX Address field width (SETUP_AW): 5 bytes.
  //  '0x00' - Ilegal.
  //  '0x01' - 3 bytes.
  //  '0x02' - 4 bytes.
  //  '0x03' - 5 bytes.
  //
  g_nrf24_config[FIRST_INDEX] = ADDRESS_WIDTH;
  nrf24_spi_handler(WRITE, SETUP_AW, g_nrf24_config, COMMAND_LENGTH);

  //
  //  Setup of Automatic Retransmission (SETUP_RETR):
  //  Auto Retransmission Delay (ARD): '0010' - Wait 750us + 86us.
  //  Auto Retransmission Count (ARC): '1111' - Up to 15 Re-Transmit.
  //
  g_nrf24_config[FIRST_INDEX] = ADR_VALUE << ARD | ARC_VALUE << ARC;
  nrf24_spi_handler(WRITE, SETUP_RETR, g_nrf24_config, COMMAND_LENGTH);

  //
  //  RF Channel Frequency (RF_CH): 2.402 GHz.
  //
  g_nrf24_config[FIRST_INDEX] = RF_CHANNEL;
  nrf24_spi_handler(WRITE, RF_CH, g_nrf24_config, COMMAND_LENGTH);

  //
  //  Air Data Rate (RF_DR): 250 kbps.
  //  RF output power in TX mode: -0 dbm.
  //
  g_nrf24_config[FIRST_INDEX] = HIGH << RF_DR_LOW
                      | TX_OUTPUT_POWER << RF_PWR;
  nrf24_spi_handler(WRITE, RF_SETUP, g_nrf24_config, COMMAND_LENGTH);

  //
  //  Feature Register (FEATURE):
  //  EN_DPL: Enables Dynamic Payload len.
  //  EN_ACK_PAY: Enables Payload with ACK.
  //
  g_nrf24_config[FIRST_INDEX] = HIGH << EN_DPL | HIGH << EN_ACK_PAY;
  nrf24_spi_handler(WRITE, FEATURE, g_nrf24_config, COMMAND_LENGTH);

  //
  //  Number of Bytes in RX Payload: dynamic payload len.
  //  DPL_P0: PTX/PRX handle dynamic payload len.
  //
  g_nrf24_config[FIRST_INDEX] = HIGH << DPL_P0
                      | LOW << DPL_P1
                      | LOW << DPL_P2
                      | LOW << DPL_P3
                      | LOW << DPL_P4
                      | LOW << DPL_P5;
  nrf24_spi_handler(WRITE, DYNPD, g_nrf24_config, COMMAND_LENGTH);

  //
  //  Receive Address Data Pipe: 5 bytes.
  //  RX_ADDR_P0: g_pipe0_address[prx_id].
  //
  nrf24_spi_handler(WRITE, RX_ADDR_P0, g_pipe0_address[id], ADDRESS_LENGTH);

  //
  //  CONFIG Register,
  //  EN_CRC: '1' - Enable CRC.
  //  Cyclic Redundancy Check (CRCO): '1' - 2 bytes.
  //  Power (PWR_UP): '0' - Power Down -> (nRF24 goes to POWER DOWN mode).
  //  '1' - Power Up -> (nrf24 goes to Standby-I mode).
  //  PRIM_RX: '0' - Primary Transmitter (PTX).
  //  '1' - Primary Receiver (PRX).
  //
  if(ptx)
  {
    //
    //  PTX mode.
    //
    g_nrf24_config[FIRST_INDEX] = LOW << PRIM_RX;
    g_ptx = true;
  }
  else
  {
    //
    //  PRX mode.
    //
    g_nrf24_config[FIRST_INDEX] = HIGH << PRIM_RX;
    _nrf24_enable();
    g_ptx = false;
  }
  g_nrf24_config[FIRST_INDEX] |= HIGH << EN_CRC | HIGH << CRCO;
  nrf24_spi_handler(WRITE, CONFIG, g_nrf24_config, COMMAND_LENGTH);

  //
  //  Power up nrf24.
  //
  pwr_state(HIGH);
}

//*****************************************************************************
//
//! @brief Handles the SPI interface between the NRF24 and the MCU.
//!
//! This function performs reading and writing operation on the registers.
//!
//! @param[in] task Operation to perform (read/write).
//! @param[in] reg  Register in which the task will be carried out.
//! @param[in] arr  Array of values to be writing, if task is eqaul to write.
//! @param[in] len  Length of the array.
//!
//! @return incoming_byte For reading operations, incoming byte the reply from
//!                       the register read.
//
//*****************************************************************************
static char
nrf24_spi_handler(uint8_t task, uint8_t reg, char *arr, uint8_t len)
{
  uint8_t i = 0;
  uint8_t incoming_byte = 0;
  //
  //  Task: READ/WRITE to a specific register.
  //  reg: nrf24 specific register.
  //  array: Array with the package to manipulate.
  //  len: Array len.
  //

  //
  //  CSN LOW - nrf24 starts to listen for commandS.
  //
  _nrf24_select();
  _delay_us(10);

  //
  //  Empty reply buffer.
  //
  bzero(g_reply_buffer, strlen(g_reply_buffer));

  if(task == WRITE)
  {
    //
    //  Write into low level register.
    //
    spi_transfer(W_REGISTER | reg);
  }
  else
  {
    //
    //  Read low level register.
    //
    spi_transfer(R_REGISTER | reg);
  }

  for (i = 0; i < len; i++)
  {
    if(task == READ)
    {
      //
      //  Send dummy bytes to read out the data.
      //
      if(R_RX_PAYLOAD == reg)
      {
        g_reply_buffer[i] = spi_transfer(NOP);
      }
      else
      {
        incoming_byte = spi_transfer(NOP);
      }
    }
    else
    {
      //
      //  Send the commands to the nrf24
      //  one at the time.
      //
      spi_transfer(array[i]);
    }
  }

  //
  //  CSN HIGH - nrf24 goes back to idle mode.
  //
  _nrf24_deselect();
  _delay_us(10);

  return incoming_byte;
}

//*****************************************************************************
//
//! @brief Handles the SPI transfer in the MCU.
//!
//! This function perfroms reading and writing operations for SPI interfaces.
//!
//! @param[in] data Data byte to be transferred over SPI.
//!
//! @return SPI_ReadRxData Reply from the SPI operation.
//
//*****************************************************************************
static char
spi_transfer(char data)
{
  //
  //  Clear the transmit buffer before
  //  next reading (good practice).
  //
  SPI_ClearTxBuffer();
  SPI_ClearRxBuffer();

  //
  //  Send byte.
  //
  SPI_WriteTxData(data);

  //
  //  Wait until transmission is complete.
  //
  while(!(SPI_ReadTxStatus() & SPI_STS_SPI_DONE));

  return SPI_ReadRxData();
}

//*****************************************************************************
//
//! @brief Clear NRF24 interrupt falgs.
//!
//! This function clears up the registers holding the data falgs.
//!
//! @return None.
//
//*****************************************************************************
static void
nrf24_irq_clear(void)
{
    //
    //  Clear nrf24 interrupt flag.
    //
    g_nrf24_config[FIRST_INDEX] = IRQ_RESET;
    nrf24_spi_handler(WRITE, STATUS, g_nrf24_config, COMMAND_LENGTH);
}

//*****************************************************************************
//
//! @brief Reset the retransmission counter.
//!
//! This function overwrites the channel frecuency in order to reset the counter.
//!
//! @return None.
//
//*****************************************************************************
static void
nrf24_plos_ctn_reset(void)
{
    //
    //  Overwrite channel frecuency 2.402 GHz.
    //
    g_nrf24_config[FIRST_INDEX] = RF_CHANNEL;
    nrf24_spi_handler(WRITE, RF_CH, g_nrf24_config, COMMAND_LENGTH);
}

//*****************************************************************************
//
//! @brief Get general status register.
//!
//! This function reads the general status register and returns its content.
//!
//! @return status An interger holing the status register based on bit position.
//
//*****************************************************************************
static uint8_t nrf24_get_status(void)
{
    //
    //  Get the current status,
    //  i.e. pending data, irq, fifo...
    //
    return nrf24_spi_handler(READ, STATUS, g_nrf24_config, COMMAND_LENGTH);
}

//*****************************************************************************
//
//! @brief Get lost packets count.
//!
//! This function reads the observer tx register to get the amount of packets
//! lost since the last transmission.
//!
//! @return count Amount fo packets already lost.
//
//*****************************************************************************
uint8_t nrf24_get_lost_packets_count(void)
{
    //
    //  Get the amount of packets already lost.
    //
    return nrf24_spi_handler(READ, OBSERVE_TX, g_nrf24_config, COMMAND_LENGTH);
}

//*****************************************************************************
//
//! @brief Flush TX register.
//!
//! @return None.
//
//*****************************************************************************
static void
flush_tx(void)
{
  //
  //  CSN LOW - nrf24 starts to listen for commands.
  //
  _nrf24_select();
  _delay_us(10);

  //
  //  Flush old data.
  //
  spi_transfer(FLUSH_TX);

  //
  //  CSN HIGH - nrf24 goes back to idle.
  //
  _nrf24_deselect();
  _delay_us(10);
}

//*****************************************************************************
//
//! @brief Flush RX register.
//!
//! @return None.
//
//*****************************************************************************
static void
flush_rx(void)
{
  //
  //  CSN LOW - nrf24 starts to listen for commands.
  //
  _nrf24_select();
  _delay_us(10);

  //
  //  Flush old data.
  //
  spi_transfer(FLUSH_RX);

  //
  //  CSN HIGH - nrf24 goes back to idle.
  //
  _nrf24_deselect();
  _delay_us(10);
}

//*****************************************************************************
//
//! @brief General reset of the NRF24.
//!
//! This function flush both TX and RX register and clear the IRQ flags.
//!
//! @return None.
//
//*****************************************************************************
static void
nrf24_reset(void)
{
    flush_tx();
    flush_rx();
    nrf24_irq_clear();
}

//*****************************************************************************
//
//! @brief Power up/down the NRF24 module.
//!
//! This function reads the power control registers and modifies the power
//! state to enable payload transmission.
//!
//! @param[in] state Power state (1/0).
//!
//! @return None.
//
//*****************************************************************************
static void
pwr_state(uint8_t state)
{
  //
  //  Get register of power control.
  //
  uint8_t reg = nrf24_spi_handler(READ, CONFIG, g_nrf24_config, COMMAND_LENGTH);

  if(state)
  {
    //
    // Power up.
    //
    _set_bit(reg, PWR_UP);
  }
  else
  {
    //
    //  Power down.
    //
    _clear_bit(reg, PWR_UP);
  }

  //
  //  Send reuqest and wait for the power state to change.
  //
  g_nrf24_config[FIRST_INDEX] = reg;
  nrf24_spi_handler(WRITE, CONFIG, g_nrf24_config, COMMAND_LENGTH);
  _delay_ms(25);
}

//*****************************************************************************
//
//! @brief Set the address of the NRF24 module.
//!
//! This function write the address of the module on the TX_ADDR register.
//!
//! @param[in] id Unique identifier (address).
//!
//! @return None.
//
//*****************************************************************************
static void
set_address(uint8_t id)
{
  //
  //  Power down mode to write on registers.
  //
  pwr_state(LOW);

  //
  //  Transmit Address (PTX device only): 5 bytes.
  //  TX_ADDR: mAddress[prx_id].
  //
  nrf24_spi_handler(WRITE, TX_ADDR, g_pipe0_address[id], ADDRESS_LENGTH);

  //
  //  Return to standby mode to transmit payload .
  //
  pwr_state(HIGH);
}

//*****************************************************************************
//
//! @brief Request data to a PRX device.
//!
//! This function requests an specific variable to an PRX device in the same
//! channel.
//!
//! @param[in] var_id  ID of the variable requested to the PRX device.
//! @param[in] prx_id  Unique id of the PRX device (address).
//!
//! @return None.
//
//*****************************************************************************
static void
ptx_request(uint8_t var_id, uint8_t prx_id)
{
  //
  //  Check if the address of PRX device was already set.
  //
  if (g_last_id != id) set_address(id);

  //
  //  Attach payload to TX FIFO.
  //
  attach_tx_payload(g_var_idiable_id[var_id], strlen(g_var_idiable_id[var_id]));
  _delay_ms(10);

  //
  //  CE HIGH - Start transmitting data
  //  CE LOW - Stop transmitting data
  //
  _nrf24_enable();
  _delay_us(25);
  _nrf24_disable();

  g_last_id = id;
}

//*****************************************************************************
//
//! @brief Transmit a string.
//!
//! This function transmit a string from the PTX device to an specific PRX
//! device in the same channel.
//!
//! @param[in] data    Data to be transmitted.
//! @param[in] len     Length of the data to be transmitted.
//! @param[in] prx_id  Unique id of the PRX device (address).
//!
//! @return None.
//
//*****************************************************************************
static void
ptx_transmit_string(char *data, uint8_t len, uint8_t prx_id)
{
  //
  //  Check if the address of PRX device was already set.
  //
  if(g_last_id != id) set_address(id);

  //
  //  Attach payload to TX FIFO.
  //
  attach_tx_payload(data, len);
  _delay_ms(10);

  //
  //  CE HIGH - Start transmitting data
  //  CE LOW - Stop transmitting data
  //
  _nrf24_enable();
  _delay_us(25);
  _nrf24_disable();

  g_last_id = id;
}

//*****************************************************************************
//
//! @brief Transmit an integer.
//!
//! This function transmit an integer value from the PTX device to an specific
//! PRX device in the same channel.
//!
//! @param[in] data    Data to be transmitted.
//! @param[in] prx_id  Unique id of the PRX device (address).
//!
//! @return None.
//
//*****************************************************************************
static void
ptx_transmit_int(int data, uint8_t prx_id)
{
  //
  //  Check if the address of PRX device was already set.
  //
  if(g_last_id != id) set_address(id);

  //
  //  Attach payload to TX FIFO.
  //
  sprintf(g_value_buffer, "%d", data);
  attach_tx_payload(g_value_buffer, strlen(g_value_buffer));
  _delay_ms(10);

  //
  //  CE HIGH - Start transmitting data
  //  CE LOW - Stop transmitting data
  //
  _nrf24_enable();
  _delay_us(25);
  _nrf24_disable();

  g_last_id = id;
}

//*****************************************************************************
//
//! @brief Transmit a float.
//!
//! This function transmit a float value from the PTX device to an specific PRX
//! device in the same channel.
//!
//! @param[in] data    Data to be transmitted.
//! @param[in] prx_id  Unique id of the PRX device (address).
//!
//! @return None.
//
//*****************************************************************************
static void
ptx_transmit_float(float data, uint8_t prx_id)
{
  //
  //  Check if the address of PRX device was already set.
  //
  if(g_last_id != id) set_address(id);

  //
  //  Attach payload to TX FIFO.
  //
  sprintf(g_value_buffer, "%.2f", data);
  attach_tx_payload(g_value_buffer, strlen(g_value_buffer));
  _delay_ms(10);

  //
  //  CE HIGH - Start transmitting data
  //  CE LOW - Stop transmitting data
  //
  _nrf24_enable();
  _delay_us(25);
  _nrf24_disable();

  g_last_id = id;
}

//*****************************************************************************
//
//! @brief Attach payload to the TX FIFO register - PTX device.
//!
//! This function accesses to TX FIFO register and writes the payload on it.
//!
//! @param[in] data Payload to be written.
//! @param[in] len  Length of the payload.
//!
//! @return None.
//
//*****************************************************************************
static void
attach_tx_payload(char *data, uint8_t len)
{
  uint8_t i;

  //
  //  Used in PTX Mode.
  //  FLUSH_TX and W_TX_PAYLOAD are from the highest registers level.
  //

  //
  //  Flush old data.
  //
  flush_tx();

  //
  //  CSN LOW - nrf24 starts to listen for commands.
  //
  _nrf24_select();
  _delay_us(10);

  //
  //  Access to TX FIFO register and
  //  writes the payload to TX FIFO.
  //
  spi_transfer(W_TX_PAYLOAD);
  for(i=0; i<len; i++)
  {
      spi_transfer(*data++);
  }

  //
  //  CSN HIGH - nrf24 goes back to idle.
  //
  _nrf24_deselect();
  _delay_us(10);
}

//*****************************************************************************
//
//! @brief Attach a string as an acknowledgment payload to TX FIFO register.
//!
//! @param[in] data String to be written.
//! @param[in] len  Length of the string.
//!
//! @return None.
//
//*****************************************************************************
static void
attach_ack_string(char* data, uint8_t len)
{
  //
  //  Attach payload to TX FIFO.
  //
  attach_ack_payload(data, len);
}

//*****************************************************************************
//
//! @brief Attach an integer value as an acknowledgment payload to TX FIFO
//!        register.
//!
//! @param[in] data Integer acknowledgment to be written.
//!
//! @return None.
//
//*****************************************************************************
static void
attach_ack_int(uint8_t data)
{
  //
  //  Attach payload to TX FIFO.
  //
  sprintf(g_value_buffer, "%d", data);
  attach_ack_payload(g_value_buffer, strlen(g_value_buffer));
}

//*****************************************************************************
//
//! @brief Attach a float value as an acknowledgment payload to TX FIFO
//!        register.
//!
//! @param[in] data Float value to be written.
//!
//! @return None.
//
//*****************************************************************************
static void
attach_ack_float(float data)
{
  //
  //  Attach payload to TX FIFO.
  //
  sprintf(g_value_buffer, "%.2f", data);
  attach_ack_payload(g_value_buffer, strlen(g_value_buffer));
}

//*****************************************************************************
//
//! @brief Attach payload to the TX FIFO register - PRX device.
//!
//! This function accesses to TX FIFO register and writes the payload on it.
//!
//! @param[in] data Payload to be written.
//! @param[in] len  Length of the payload.
//!
//! @return None.
//
//*****************************************************************************
static void
attach_ack_payload(char *data, uint8_t len)
{
  uint8_t i;

  //
  //  CSN LOW - nrf24 starts to listen for commands.
  //
  _nrf24_select();
  _delay_us(10);

  //
  //  Access to TX FIFO register and
  //  writes the payload to TX FIFO.
  //
  spi_transfer(W_ACK_PAYLOAD);
  for(i=0; i<len; i++)
  {
      spi_transfer(*data++);
  }

  //
  //  CSN HIGH - nrf24 goes back to idle.
  //
  _nrf24_deselect();
  _delay_us(10);
}

//*****************************************************************************
//
//! @brief Attach payload to the TX FIFO register - PRX device.
//!
//! This function accesses to TX FIFO register and writes the payload on it.
//!
//! @param[in] data Payload to be written.
//! @param[in] len  Length of the payload.
//!
//! @return None.
//
//*****************************************************************************
static uint8_t
check_status(void)
{
    switch(g_status)
    {
        case NRF24_ACK_PAYLOAD_RECEIVED:
            nrf24_spi_handler(READ, R_RX_PAYLOAD, g_nrf24_config, NRF24_get_reply_len());
            break;
        case NRF24_TRANSMISSION_FAILED:
            return false;
            break;
    }
    return true;
}

//*****************************************************************************
//
//! @brief ISR for the NRF24 module.
//!
//! This function is triggered every time a new packet has been recieved. It
//! handles a different procedure for both PTX and PRX. In general, the ISR
//! makes sure that the data was recieved without errors and performs reset
//! operation in flag and counters to ensure proper functionality.
//!
//! @return None.
//
//*****************************************************************************
CY_ISR(nrf24_Int_Handler)
{
  uint8_t status_register = nrf24_get_status();

  if(g_ptx)
  {
    //
    //  PTX mode:
    //
    //  If the ACK packet contains a
    //  payload RX_DR IRQ is asserted.
    //
    if(status_register & (HIGH << RX_DR))
    {
      //
      //  ACK Payload Received - Transmission successful.
      //
      g_status = NRF24_ACK_PAYLOAD_RECEIVED;
    }
    else if(status_register & (HIGH << MAX_RT))
    {
      //
      //  Transmission failed.
      //
      g_status = NRF24_TRANSMISSION_FAILED;

      //
      //  Reset PLOS_CNT by overwriting to
      //  the RF_CH register.
      //
      nrf24_plos_ctn_reset();
    }
  }
  else
  {
    //
    //  PRX mode:
    //
    if(status_register & (HIGH << RX_DR))
    {
      //
      //  ACK Payload Received.
      //
      g_status = NRF24_ACK_PAYLOAD_RECEIVED;

      //
      //  Get PTX reply.
      //
      nrf24_spi_handler(READ, R_RX_PAYLOAD, g_nrf24_config, NRF24_get_reply_len());

      //
      //  Check which var_idiable was requested
      //  and attach ack payload to TX FIFO.
      //
      uint8_t num = (uint8_t)atoi(g_reply_buffer);
      attach_ack_int(g_data_int[num]);
    }
  }

  //
  //  Clear nrf24 interrupt flag.
  //
  nrf24_irq_clear();
  g_request_flag = true;

  //
  //  Clear psoc digital pin interrupt.
  //
  Pin_IRQ_ClearInterrupt();
}
